/*Console.WriteLine("Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.");
Console.Write("Введите первое число: ");
int a = int.Parse(Console.ReadLine()!);
Console.Write("Введите второе число: ");
int b = int.Parse(Console.ReadLine()!);

if(a < b)
{
    Console.WriteLine("А меньше В");
}
else
{
    if(a > b)
    {
        Console.WriteLine("B меньше А");
    }
}*/

/*Console.WriteLine("Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.");
Console.Write("Введите первое число: ");
int num1 = int.Parse(Console.ReadLine()!);
Console.Write("Введите второе число: ");
int num2 = int.Parse(Console.ReadLine()!);
Console.Write("Введите третье число: ");
int num3 = int.Parse(Console.ReadLine()!);

int max = num1;
if(max < num2)
{ 
   max = num2;
}
if(max < num3)
{ 
   max = num3;
}
Console.WriteLine($"Максимальное число = {max}");*/

/*Console.WriteLine("Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).");
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine()!);

if(number%2 == 0)
{ 
    Console.WriteLine("Число четное");
}
else
{
    Console.WriteLine("Число нечетное");
}*/

/*Console.WriteLine("Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.");
Console.Write("Введите N: ");
int N = int.Parse(Console.ReadLine()!);
int I = 1;
while (I <= N)
{
    if ( I%2 == 0)
    {
        Console.WriteLine($"{I} ");
    }
    I++;
}*/